app/Controllers/CallRun.php

UPDATE `people` SET `status` = 'inactive', `first_name` = '-', `last_name` = '-', `work_email` = 'inactive@lawboss.com'
WHERE `people`.`employee_id` IN ('8372')
UPDATE `content` SET `status` = 'inactive', `is_searchable` = 0
WHERE `content`.`content_id` IN ('8372')
---
    				if(!empty($person['person_id'])){
        				//echo $person['first_name']." ".$person['last_name']." --> ".$value['statusCode']."<br>";
        				$update_data = ['status'=>'inactive', 'first_name'=>'-', 'last_name'=>'-', 'work_email'=>'inactive@lawboss.com']; //var_dump($update_data);
        				$people->update($value['employeeId'], $update_data);
        				$content = new ContentModel();
        				$update_data2 = ['status'=>'inactive', 'is_searchable'=>0];
        				$where = ['external_id' => $value['employeeId']];
						$content->update($where, $update_data2);