app/Models/CustomerModel.php

SELECT *
FROM `customers`
WHERE `customers`.`id` = '2'
---
    public function getCustomer($id = false)
    {
        if($id === false){
            return $this->findAll();
        } else {
            return $this->find($id);