app/Models/PickModel.php

SELECT DISTINCT `picker`
FROM `pick_upload_temp`
---
  public function distinctPickers()
  {
    $builder = $this->db->table('pick_upload_temp');
    $builder->select('picker');
    $builder->distinct('picker');
    $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;

SELECT SUM(ABS(transaction_qty)) AS total
FROM `pick_upload_temp`
WHERE `picker` = 'CARLOSG   '
AND `complete_date` = '2023-08-22'
AND `complete_time` >= '0:00'
AND `complete_time` <= '00:59:59'
AND `doc_type` = 'Pick'
AND `cust_name` = 'Sprout Foods, Inc'
AND `new_type` = 'cases'
---
  public function countPicks($picker, $date, $start, $end, $type, $docType, $cust='Speedo C/O Dawson Logistics')
  {
    //$date = date('m/d/y', strtotime($date));
    $type = strtolower($type);
    $end = new \DateTime($end);
    $end->modify('-1 second');
    $end = $end->format('H:i:s');
    $builder = $this->db->table('pick_upload_temp');
    if($cust=='Speedo C/O Dawson Logistics'){
      $builder->select('COUNT(picker) AS total');
    }else{
     if($type=='pallet'){
      $builder->select('COUNT(picker) AS total');
     }else{
      $builder->select('SUM(ABS(transaction_qty)) AS total');
     }
    }

    $builder->where(array('picker'=>$picker, 'complete_date'=>$date, 'complete_time>='=>$start, 'complete_time<='=>$end, 'doc_type'=>$docType, 'cust_name'=>$cust, 'new_type'=>$type));
    $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;

SELECT SUM(ABS(transaction_qty)) AS total
FROM `pick_upload_temp`
WHERE `picker` = 'CARLOSG   '
AND `complete_date` = '2023-08-22'
AND `doc_type` = 'Pick'
AND `cust_name` = 'Sprout Foods, Inc'
AND `new_type` = 'cases'
---
  public function totalPickerCountPerDay($picker, $date, $type, $docType, $cust='Speedo C/O Dawson Logistics')
  {
    //$date = date('m/d/y', strtotime($date));
    $type = strtolower($type);
    $builder = $this->db->table('pick_upload_temp');
    if($cust=='Speedo C/O Dawson Logistics'){
      $builder->select('COUNT(picker) AS total');
    }else{
      if($type=='pallet'){
        $builder->select('COUNT(picker) AS total');
       }else{
        $builder->select('SUM(ABS(transaction_qty)) AS total');
       }
    }
    $builder->where(array('picker'=>$picker, 'complete_date'=>$date, 'doc_type'=>$docType, 'cust_name'=>$cust, 'new_type'=>$type));
    $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;

SELECT *
FROM `gen_set`
WHERE `name` = 'MAIL_REPORT'
---
  public function mailReportSettings()
  {
    $builder = $this->db->table('gen_set');
    $builder->select('*');
    $builder->where('name', 'MAIL_REPORT');
    $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;

SELECT `picker`, `start_date`, `start_time`, `complete_date`, `complete_time`, `transaction_qty`
FROM `pick_upload_temp`
WHERE `start_date` = '2023-08-22'
AND `cust_name` = 'Sprout Foods, Inc'
AND `doc_type` = 'Pick'
ORDER BY `picker` ASC, `complete_time` DESC
---
  public function getAllData($date, $type, $docType, $cust){
      $builder = $this->db->table('pick_upload_temp');
        $builder->select('picker, start_date, start_time, complete_date, complete_time, transaction_qty, new_type');
        $builder->where('start_date', $date);
        $builder->where('cust_name', $cust);
        $builder->where('new_type', $type);
        $builder->where('doc_type', $docType);
        $builder->orderBy('picker ASC, complete_time DESC');
       // $builder->limit(100);
        $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;