app/Models/PickModel.php

  public function mailReportSettings()
  {
    $builder = $this->db->table('gen_set');
    $builder->select('*');
    $builder->where('name', 'MAIL_REPORT');
    $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;
---
SELECT *
FROM `gen_set`
WHERE `name` = 'MAIL_REPORT'

  public function getAllData($date, $type, $docType, $cust){
      $builder = $this->db->table('pick_upload_temp');
        $builder->select('picker, start_date, start_time, complete_date, complete_time');
        $builder->where('start_date', $date);
        $builder->where('cust_name', $cust);
        $builder->where('new_type', $type);
        $builder->where('doc_type', $docType);
        $builder->orderBy('picker ASC, complete_time DESC');
       // $builder->limit(100);
        $data = $builder->get()->getResult(); //var_dump($this->db->getLastQuery()); exit;
---
SELECT `picker`, `start_date`, `start_time`, `complete_date`, `complete_time`
FROM `pick_upload_temp`
WHERE `start_date` = '2023-05-11'
AND `cust_name` = 'Speedo C/O Dawson Logistics'
AND `new_type` = 'pallet'
AND `doc_type` = 'Pick'
ORDER BY `picker` ASC, `complete_time` DESC